test.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/10.0">
 <soapenv:Header/>
 <soapenv:Body>
  <ns:executeSQLQuery sequence="1234">
   <sql>Select name from device where tkclass = 1</sql>
  </ns:executeSQLQuery>
 </soapenv:Body>
</soapenv:Envelope>
